ATsupportum/src/Catalogs/НастройкиПереносаОформленияСписков/НастройкиПереносаОформленияСписков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПереносаОформленияСписков</name>
  <attributes>
    <name>ПользовательИсточник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>ПолноеИмяСписка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПользователиПриемники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПользователиИсключения</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПользователиИтоговый</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/Catalogs/НастройкиПереносаОформленияСписков/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сообщить("Настройка по умолчанию должна называться Стандартная");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для каждого ПользовательПриемник Из ТекущийОбъект.ПользователиПриемники Цикл
	    Если ТипЗнч(ПользовательПриемник.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		
			НовСтрока = ТекущийОбъект.ПользователиИтоговый.Добавить();
			НовСтрока.Пользователь = ПользовательПриемник.Пользователь;
		ИначеЕсли  ТипЗнч(ПользовательПриемник.Пользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			Для каждого ПользовательГруппы Из  ПользовательПриемник.Пользователь.ПользователиГруппы Цикл
			
				НовСтрока = ТекущийОбъект.ПользователиИтоговый.Добавить();
				НовСтрока.Пользователь = ПользовательГруппы.Пользователь;
			
			КонецЦикла;
		
			
		
		КонецЕсли;
		
	
	КонецЦикла;
	
	Для каждого ПользовательИсключения Из ТекущийОбъект.ПользователиИсключения Цикл
		ПараметрыОтбора = Новый Структура("Пользователь",ПользовательИсключения.Пользователь);
	    НайденныеСтроки = ТекущийОбъект.ПользователиИтоговый.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			Для каждого найденнаястрока Из НайденныеСтроки Цикл
				
				ТекущийОбъект.ПользователиИтоговый.Удалить(найденнаястрока);
								
			КонецЦикла;	
	    КонецЕсли;
	КонецЦикла;
	
	   ТекущийОбъект.ПользователиИтоговый.Свернуть("Пользователь");
 

	
КонецПроцедуры
